[
  {
    "_id": "5ed75a0baf521006a890287a",
    "labname": "DESIGN AND ANALYSIS OF ALGORITHM LABORATORY",
    "labcode": "17CSL47",
    "descname": "Description",
    "descdata": "Design, develop, and implement the specified algorithms for the following problems using Java language under LINUX /Windows environment.Netbeans/Eclipse IDE tool can be used for development and demonstration.",
    "prgmlist": "Laboratory Experiments:",
    "prgmlistdata": "1. A) Create a Java class called Studentwith the following details as variables within it.\n (i) USN\n (ii) Name\n (iii) Branch\n (iv) Phone Write a Java program to create n Student objects and print the USN, Name, Branch, and Phoneof these objects with suitable headings. \n B) Write a Java program to implement the Stack using arrays.\n Write Push(), Pop(), and Display() methods to demonstrate its working. \n\n 2. A) Design a superclass called Staff with details as StaffId, Name, Phone, Salary. Extend this class by writing three subclasses namely Teaching (domain, publications), Technical (skills), and Contract (period). Write a Java program to read and display at least 3 staff objects of all three categories. \n B) Write a Java class called Customer to store their name and date_of_birth. The date_of_birth format should be dd/mm/yyyy. Write methods to read customer data as <name, dd/mm/yyyy> and display as <name, dd, mm, yyyy> using StringTokenizer class considering the delimiter character as “/”.\n\n 3. A) Write a Java program to read two integers a andb. Compute a/b and print, when b is not zero. Raise an exception when b is equal to zero.\n B) Write a Java program that implements a multi-thread application that has three threads. First thread generates a random integer for every 1 second; second thread computes the square of the number andprints; third thread will print the value of cube of the number. \n\n 4. Sort a given set of n integer elements using Quick Sort method and compute its time complexity. Run the program for varied values of n> 5000 and record the time taken to sort. Plot a graph of the time taken versus non graph sheet. The elements can be read from a file or can be generated using the random number generator. Demonstrate using Java how the divideand-conquer method works along with its time complexity analysis: worst case, average case and best case.\n\n 5. Sort a given set of n integer elements using Merge Sort method and compute its time complexity. Run the program for varied values of n> 5000, and record the time taken to sort. Plot a graph of the time taken versus non graph sheet. The elements can be read from a file or can be generated using the random number generator. Demonstrate using Java how the divide-and-conquer method works along with its time complexity analysis: worst case, average case and best case.\n\n6. Implement in Java, the 0/1 Knapsack problem using\n (a) Dynamic Programming method\n (b) Greedy method. \n\n 7. From a given vertex in a weighted connected graph, find shortest paths to other vertices using Dijkstra's algorithm. Write the program in Java. \n\n 8. Find Minimum Cost Spanning Tree of a given connected undirected graph using Kruskal'salgorithm. Use Union-Find algorithms in your program. \n\n 9. Find Minimum Cost Spanning Tree of a given connected undirected graph using Prim's algorithm.\n 10. Write Java programs to (a) Implement All-Pairs Shortest Paths problem using Floyd's algorithm. (b) Implement Travelling Sales Person problem using Dynamic programming.\n\n 11. Design and implement in Java to find a subset of a given set S = {Sl, S2,.....,Sn} of n positive integers whose SUM is equal to a given positive integer d.\n For example, if S ={1, 2, 5, 6, 8} and d= 9, there are two solutions {1,2,6}and {1,8}. \nDisplay a suitable message, if the given problem instance doesn't have a solution.\n\n 12. Design and implement in Java to find all Hamiltonian Cycles in a connected undirected Graph G of n vertices using backtracking principle.\n",
    "labname1": "MICROPROCESSOR AND MICROCONTROLLER LABORATORY",
    "labcode1": "17CSL48",
    "descname1a": "Description about Lab",
    "prgmlist1a": "SOFTWARE PROGRAMS: PART A ",
    "prgmlistdata1a": "1. Design and develop an assembly language program to search a key element “X” in a list of ‘n’ 16-bit numbers. Adopt Binary search algorithm in your program for searching.\n\n 2. Design and develop an assembly program to sort a given set of ‘n’ 16-bit numbers in ascending order. Adopt Bubble Sort algorithm to sort given elements.\n\n 3. Develop an assembly language program to reverse a given string and verify whether it is a palindrome or not. Display the appropriate message.\n\n 4. Develop an assembly language program to compute nCr using recursive procedure. Assume that ‘n’ and ‘r’ are non-negative integers.\n\n 5. Design and develop an assembly language program to read the current time and Date from the system and display it in the standard format on the screen.\n\n 6. To write and simulate ARM assembly language programs for data transfer, arithmetic and logical operations (Demonstrate with the help of a suitable program).\n\n 7. To write and simulate C Programs for ARM microprocessor using KEIL (Demonstrate with the help of a suitable program)\n\n Note : To use KEIL one may refer the book: Insider’s Guide to the ARM7 based microcontrollers, Hitex Ltd.,1st edition, 2005",
    "descname1b": "Experiments ",
    "descdata1b": "• Develop and execute the following programs using 8086 Assembly Language. Any suitable assembler like MASM/TASM/8086 kit or any equivalent software may be used.\n  • Program should have suitable comments.\n • The board layout and the circuit diagram of the interface are to be provided to the student during the examination.\n  • Software Required: Open source ARM Development platform, KEIL IDE and Proteus for simulation.",
    "prgmlist1b": "HARDWARE PROGRAMS: PART B ",
    "prgmlistdata1b": "8. a. Design and develop an assembly program to demonstrate BCD Up-Down Counter (00-99) on the Logic Controller Interface.\n b. Design and develop an assembly program to read the status of two 8-bit inputs (X & Y) from the Logic Controller Interface and display X*Y.\n\n 9. Design and develop an assembly program to display messages “FIRE” and “HELP” alternately with flickering effects on a 7-segment display interface for a suitable period of time. Ensure a flashing rate that makes it easy to read both the messages (Examiner does not specify these delay values nor is it necessary for the student to compute these values).\n\n 10. Design and develop an assembly program to drive a Stepper Motor interface and rotate the motor in specified direction (clockwise or counter-clockwise) by N steps (Direction and N are specified by the examiner). Introduce suitable delay between successive steps. (Any arbitrary value for the delay may be assumed by the student).\n\n 11. Design and develop an assembly language program to\n a. Generate the Sine Wave using DAC interface (The output of the DAC is to be displayed on the CRO).\n b. Generate a Half Rectified Sine waveform using the DAC interface. (The output of the DAC is to be displayed on the CRO).\n\n 12. To interface LCD with ARM processor-- ARM7TDMI/LPC2148. Write and execute programs in C language for displaying text messages and numbers on LCD 13. To interface Stepper motor with ARM processor-- ARM7TDMI/LPC2148. Write a program to rotate stepper motor.\n\n Study Experiments:\n 1. Interfacing of temperature sensor with ARM freedom board (or any other ARM microprocessor board) and display temperature on LCD.\n\n 2. To design ARM cortex based automatic number plate recognition system.\n\n 3. To design ARM based power saving system."
  }
]
