[
  {
    "_id": "5ed78497377e443034e6e962",
    "labname": "MACHINE LEARNING LABORATORY",
    "labcode": "17CSL76  ",
    "descname": "Description (If any): ",
    "descdata": "1. The programs can be implemented in either JAVA or Python.\n 2. For Problems 1 to 6 and 10, programs are to be developed without using the built-in classes or APIs of Java/Python.\n 3. Data sets can be taken from standard repositories (https://archive.ics.uci.edu/ml/datasets.html) or constructed by the students ",
    "prgmlist": "Lab Experiments: ",
    "prgmlistdata": "1. Implement and demonstratethe FIND-Salgorithm for finding the most specific hypothesis based on a given set of training data samples. Read the training data from a .CSV file.\n\n2. For a given set of training data examples stored in a .CSV file, implement and demonstrate the Candidate-Elimination algorithmto output a description of the set of all hypotheses consistent with the training examples.\n\n3.Write a program to demonstrate the working of the decision tree based ID3 algorithm. Use an appropriate data set for building the decision tree and apply this knowledge toclassify a new sample. \n\n4.Build an Artificial Neural Network by implementing the Backpropagation algorithm and test the same using appropriate data sets. \n\n5. Write a program to implement the naïve Bayesian classifier for a sample training data set stored as a .CSV file. Compute the accuracy of the classifier, considering few test data sets. \n\n6.Assuming a set of documents that need to be classified, use the naïve Bayesian Classifier model to perform this task. Built-in Java classes/API can be used to write the program. Calculate the accuracy, precision, and recall for your data set\n\n7. Write a program to construct aBayesian network considering medical data. Use this model to demonstrate the diagnosis of heart patients using standard Heart Disease Data Set. You can use Java/Python ML library classes/API.\n\n 8. Apply EM algorithm to cluster a set of data stored in a .CSV file. Use the same data set for clustering using k-Means algorithm. Compare the results of these two algorithms and comment on the quality of clustering. You can add Java/Python ML library classes/API in the program.\n\n9. Write a program to implement k-Nearest Neighbour algorithm to classify the iris data set. Print both correct and wrong predictions. Java/Python ML library classes can be used for this problem. \n\n10. Implement the non-parametric Locally Weighted Regressionalgorithm in order to fit data points. Select appropriate data set for your experiment and draw graphs. ",
    "labname1": " WEB TECHNOLOGY LABORATORY WITH MINI PROJECT ",
    "labcode1": "17CSL77   ",
    "descname1a": "Description (If any):",
    "prgmlist1a": "Lab Experiments: ",
    "prgmlistdata1a": "1. Write a JavaScript to design a simple calculator to perform the following operations: sum, product, difference and quotient.\n\n 2. Write a JavaScript that calculates the squares and cubes of the numbers from 0 to 10 and outputs HTML text that displays the resulting values in an HTML table format.\n\n 3. Write a JavaScript code that displays text “TEXT-GROWING” with increasing font size in the interval of 100ms in RED COLOR, when the font size reaches 50pt it displays “TEXT-SHRINKING” in BLUE color. Then the font size decreases to 5pt.\n\n 4. Develop and demonstrate a HTML5 file that includes JavaScript script that uses functions for the following problems:\n a. Parameter: A string \nb. Output: The position in the string of the left-most vowel \nc. Parameter: A number\n d. Output: The number with its digits in the reverse order \n\n5. Design an XML document to store information about a student in an engineering college affiliated to VTU. The information must include USN, Name, and Name of the College, Branch, Year of Joining, and email id. Make up sample data for 3 students. Create a CSS style sheet and use it to display the document.\n\n 6. Write a PHP program to keep track of the number of visitors visiting the web page and to display this count of visitors, with proper headings.\n\n 7. Write a PHP program to display a digital clock which displays the current time of the server. \n\n 8. Write the PHP programs to do the following:\n a. Implement simple calculator operations.\n b. Find the transpose of a matrix. \nc. Multiplication of two matrices.\n d. Addition of two matrices. \n9. Write a PHP program named states.py that declares a variable states with value 'Mississippi Alabama Texas Massachusetts Kansas'. write a PHP program that does the following:\n a. Search for a word in variable states that ends in xas. Store this word in element 0 of a list named statesList. \nb. Search for a word in states that begins with k and ends in s. Perform a caseinsensitive comparison. [Note: Passing re.Ias a second parameter to method compile performs a case-insensitive comparison.] Store this word in element1 of statesList.\n c. Search for a word in states that begins with M and ends in s. Store this word in element 2 of the list. \n d. Search for a word in states that ends in a. Store this word in element 3 of the list. \n\n10. Write a PHP program to sort the student records which are stored in the database using selection sort",
    "prgmlist1b": "Study Experiment / Project: ",
    "prgmlistdata1b": "Develop a web application project using the languages and concepts learnt in the theory and exercises listed in part A with a good look and feel effects. You can use any web technologies and frameworks and databases.\n\nNote: \n\n1. In the examination each student picks one question from part A.\n  2. A team of two or three students must develop the mini project. However during the examination, each student must demonstrate the project individually.\n 3. The team must submit a brief project report (15-20 pages) that must include the following: \na. Introduction \n  b. Requirement Analysis \n  c. Software Requirement Specification \n  d. Analysis and Design \n  e. Implementation \n  f. Testing "
  }
]
