[
  {
    "_id": "5ed75a43af521006a890287b",
    "labname": "PROJECT WORK PHASE II ",
    "labcode": "17CSP85 ",
    "descname": "Description",
    "descdata": "• Project: Carried out at the Institution or at an Industry.\n • Project work shall preferably be batch wise, the strength of each batch shall not exceed maximum of four students • Viva-voce examination in project work shall be conducted batch-wise.\n • For Project Phase –I and Project seminar and Project Phase –II, the CIE shall be 100 respectively.\n • The CIE marks in the case of projects in the final year shall be based on the evaluation at the end of VIII semester by a committee consisting of the Head of the concerned Department and two senior faculty members of the Department, one of whom shall be the project guide. \n• Minimum requirement of CIE marks for Project work shall be 50% of the maximum marks.\n • Students failing to secure a minimum of 50% of the CIE marks in Project work shall not be eligible for the Project examination conducted by the University and they shall be considered as failed in that/those Course/s. However, they can appear for University examinations conducted in other Courses of the same semester and backlog Courses if any. Students after satisfying the prescribed minimum CIE marks in the Course/s when offered during subsequent semester shall appear for SEE. \n• Improvement of CIE marks shall not be allowed in Project where the student has already secured the minimum required marks\n • For a pass in a Project/Viva-voce examination, a student shall secure a minimum of 40% of the maximum marks prescribed for the University Examination. The Minimum Passing Grade in a Course is ‘E’.\n • The student who desires to reject the results of a semester shall reject performance in all the Courses of the semester, irrespective of whether the student has passed or failed in any Course. However, the rejection of performance of VIII semester project shall not be permitted.",
    "prgmlist": "Course outcomes",
    "prgmlistdata": "1. Identify a issue and derive problem related to society, environment, economics, energy and technology.\n 2. Formulate and Analyze the problem and determine the scope of the solution chosen.\n 3. Determine , dissect, and estimate the parameters, required in the solution.\n 4. Evaluate the solution by considering the standard data / Objective function and by using appropriate performance metrics.\n 5. Compile the report and take part in present / publishing the finding in a reputed conference / publications\n 6. Attempt to obtain ownership of the solution / product developed.",
    "labname1": "SEMINAR ",
    "labcode1": "17CSS86 ",
    "descname1": "Description",
    "descdata1": "• Seminar: Deliverable at the Institution under the supervision of a Faculty.\n • Seminar is one of the head of passing. i) Each candidate shall deliver seminar as per the Scheme of Teaching and Examination on the topics chosen from the relevant fields for about 30 minutes. ii) The Head of the Department shall make arrangements for conducting seminars through concerned faculty members of the Department. The committee constituted for the purpose by the Head of the Department shall award the CIE marks for the seminar. The committee shall consist of three faculty from the Department and the senior most acting as the Chairman/Chairperson. [To be read along with 17 OB 8.6] \n• For Technical seminar, the CIE marks shall be 100.\n • The CIE marks in the case of projects and seminars in the final year shall be based on the evaluation at the end of VIII semester by a committee consisting of the Head of the concerned Department and two senior faculty members of the Department, one of whom shall be the project / seminar guide.\n • For seminar, the minimum requirement of CIE marks shall be 40% of the maximum marks.\n • If any student fails to secure a minimum of 40% of the maximum CIE marks in seminar/ fails to deliver the seminar, he/she shall be considered as failed in that Course and shall not be eligible for the award of degree. However, the student shall become eligible for the award of degree after satisfying the requirements prescribed for seminar during the subsequent semester/s.\n • Improvement of CIE marks shall not be allowed in Seminar where the student has already secured the minimum required marks.\n • Seminar topics must be from recent advancements in the domain.\n • Each candidate must submit three copies of the report to the department. One for the candidate, one for the guide and one for the department.",
    "prgmlist1": "Course outcomes",
    "prgmlistdata1": "• Survey the changes in the technologies relevant to the topic selected\n • Discuss the technology and interpret the impact on the society, environment and domain. \n• Compile report of the study and present to the audience, following the ethics. "
  }
]
